etc/OpenFOAM_Sample_Files/outdoor_airflow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(-7.91217041015625 -12.130292415618896 0.0)
	(39.358625411987305 -12.130292415618896 0.0)
	(39.358625411987305 139.49590752395216 0.0)
	(-7.91217041015625 139.49590752395216 0.0)
	(-7.91217041015625 -12.130292415618896 21.189438343048096)
	(39.358625411987305 -12.130292415618896 21.189438343048096)
	(39.358625411987305 139.49590752395216 21.189438343048096)
	(-7.91217041015625 139.49590752395216 21.189438343048096)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (9 10 2) 
simpleGrading (
	1.0
	(
		(0.1 20.0 1.0)
		(0.3 60.0 1.0)
		(0.6 20.0 1.0)
	)
	1.0
	)
);

edges
(
);

boundary
(   leftSide
   {
       type patch;
       faces
       (       
	(3 0 4 7)
       );
   }

   rightSide
   {
       type patch;
       faces
       (       
	(1 2 6 5)
       );
   }

   outlet
   {
       type patch;
       faces
       (       
	(2 3 7 6)
       );
   }

   top
   {
       type patch;
       faces
       (       
	(4 5 6 7)
       );
   }

   ground
   {
       type wall;
       faces
       (       
	(3 2 1 0)
       );
   }

   inlet
   {
       type patch;
       faces
       (       
	(0 1 5 4)
       );
   }
);

mergePatchPair
(
);
