etc/OpenFOAM_Sample_Files/outdoor_airflow/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		p;
}

dimensions		[0 2 -2 0 0 0 0];

#include		"initialConditions";

internalField		uniform $pressure;

boundaryField
{

    leftSide
    {

        type		slip;

    }

    rightSide
    {

        type		slip;

    }

    outlet
    {

        type		fixedValue;

        value		uniform $pressure;

    }

    top
    {

        type		slip;

    }

    ground
    {

        type		zeroGradient;

    }

    buildings
    {

        type		zeroGradient;

    }

    inlet
    {

        type		zeroGradient;

    }

}