etc/OpenFOAM_Sample_Files/outdoor_airflow/0/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/

Uref		2.0;

Zref		10;

z0		uniform 1.0;

flowDir		(0.0 1.0 0.0);

zDir		(0 0 1);

zGround		uniform 0.0;

value		$internalField;