etc/OpenFOAM_Sample_Files/outdoor_airflow/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		epsilon;
}

dimensions		[0 2 -3 0 0 0 0];

#include		"initialConditions";

internalField		uniform $turbulentEpsilon;

boundaryField
{

    leftSide
    {

        type		slip;

    }

    rightSide
    {

        type		slip;

    }

    outlet
    {

        type		inletOutlet;

        inletValue		uniform $turbulentEpsilon;

        value		$internalField;

    }

    top
    {

        type		slip;

    }

    ground
    {

        type		zeroGradient;

    }

    buildings
    {

        type		epsilonWallFunction;

        value		$internalField;

    }

    inlet
    {

        type		atmBoundaryLayerInletEpsilon;

        #include		"ABLConditions";

    }

}