etc/OpenFOAM_Sample_Files/outdoor_airflow/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/

flowVelocity		(0 0 0);

pressure		0;

turbulentKE		0.38980;

turbulentEpsilon		0.00887;

#inputMode		merge;